test/src/test/testtool/EsbSoapValidator/15b/in.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<MessageHeader xmlns="http://nn.nl/XSD/Generic/MessageHeader/1">
			<From>
				<Id>Ibis4Baco</Id>
			</From>
			<To>
				<Location>ESB.PensionsCorporate.TS.Employer.EmployerBACO.1.GetEmployerDetails.1.Request
				</Location>
			</To>
			<HeaderFields>
				<CPAId>n/a</CPAId>
				<ConversationId>bert.simsom.biz_0ace08b7-33f453e2_15180608e15_-6c18
				</ConversationId>
				<MessageId>bert.simsom.biz_0ace08b7-33f453e2_15180608e15_-6c17
				</MessageId>
				<Timestamp>2015-12-08T17:03:28</Timestamp>
			</HeaderFields>
			<Service>
				<Name>Employer</Name>
				<Context>EmployerBACO</Context>
				<Action>
					<Paradigm>Request</Paradigm>
					<Name>GetEmployerDetails</Name>
					<Version>1</Version>
				</Action>
			</Service>
		</MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<GetEmployerDetails_Request
			xmlns="http://nn.nl/XSD/PensionsCorporate/Employer/EmployerBACO/1/GetEmployerDetails/1">
			<PortalOrganisationUnit>
				<Id>162</Id>
			</PortalOrganisationUnit>
			<EmployerDetailsTipe>3</EmployerDetailsTipe>
			<WGPAccount>
				<Id>1000000000</Id>
			</WGPAccount>
		</GetEmployerDetails_Request>
	</soapenv:Body>
</soapenv:Envelope>